# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

n = int(input('Введите число: '))
print(bin(n)[2:])